# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Sam\OneDrive\Github\PSoC-4-Motor-Controller\PSoC 4 Encoder Modbus Slave.cydsn\PSoC 4 Encoder Modbus Slave.cyprj
# Date: Sat, 28 Feb 2015 18:24:38 GMT
#set_units -time ns
create_clock -name {MotorCurrentADC_intClock(FFB)} -period 1000 -waveform {0 500} [list [get_pins {ClockBlock/ff_div_7}]]
create_clock -name {MessageTimerClock(FFB)} -period 2000 -waveform {0 1000} [list [get_pins {ClockBlock/ff_div_8}]]
create_clock -name {ModbusUART_SCBCLK(FFB)} -period 541.66666666666663 -waveform {0 270.833333333333} [list [get_pins {ClockBlock/ff_div_3}]]
create_clock -name {CyHFCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/hfclk}]]
create_generated_clock -name {MotorCurrentADC_intClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 25 49} [list]
create_generated_clock -name {MessageTimerClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 49 97} [list]
create_generated_clock -name {PWMClock} -source [get_pins {ClockBlock/hfclk}] -edges {1 4801 9601} [list [get_pins {ClockBlock/udb_div_1}]]
create_generated_clock -name {ModbusUART_SCBCLK} -source [get_pins {ClockBlock/hfclk}] -edges {1 13 27} -nominal_period 541.66666666666663 [list]
create_generated_clock -name {timer_clock} -source [get_pins {ClockBlock/hfclk}] -edges {1 24001 48001} [list [get_pins {ClockBlock/udb_div_3}]]
create_clock -name {CyIMO} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CySYSCLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/sysclk}]]
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyLFCLK} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyRouted1} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/dsi_in_0}]]


# Component constraints for C:\Users\Sam\OneDrive\Github\PSoC-4-Motor-Controller\PSoC 4 Encoder Modbus Slave.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Sam\OneDrive\Github\PSoC-4-Motor-Controller\PSoC 4 Encoder Modbus Slave.cydsn\PSoC 4 Encoder Modbus Slave.cyprj
# Date: Sat, 28 Feb 2015 18:24:29 GMT
